app/Services/CourseService.php

    public function getPopularCourses(int $limit = 6): Collection
    {
        return Course::with(['category', 'instructor'])
            ->withCount('enrollments')
            ->where('status', 'published')
            ->orderBy('enrollments_count', 'desc')
            ->limit($limit)
            ->get();
---
select * from "enrollments" where "enrollments"."course_id" in (9, 10, 11, 12, 19, 20, 21, 22, 23, 24, 25, 26)
select count(*) as aggregate from "courses" where "status" = 'published'