routes/web.php

select * from "courses" order by "created_at" desc limit 3
---
|--------------------------------------------------------------------------
*/
Route::get('/', function () {
    return Inertia::render('Index/Welcome', [
        'canLogin' => Route::has('login'),
        'canRegister' => Route::has('register'),
        'courses' => Course::latest()->take(3)->get(),
    ]);

select count(*) as aggregate from "users"
select count(*) as aggregate from "courses"
select count(*) as aggregate from "permissions"
select count(*) as aggregate from "roles"
select count(*) as aggregate from "quizzes"
select count(*) as aggregate from "enrollments"
---

    // Dashboard
Route::get('/dashboard', function () {
    $stats = Cache::remember('dashboard_stats', 60*60, function () {
        return [
            'users' => (int) DB::table('users')->count(),
            'roles' => (int) DB::table('roles')->count(),
            'permissions' => (int) DB::table('permissions')->count(),
            'courses' => (int) DB::table('courses')->count(),
            'quizzes' => (int) DB::table('quizzes')->count(),
            'enrollments' => (int) DB::table('enrollments')->count(),
        ];
    });