app/Http/Controllers/Course/CourseManagementController.php

         $coursesQuery->orderBy($field, $order);

         // Get paginated results
         $courses = $coursesQuery->paginate($perPage)
             ->withQueryString() // Preserve query parameters in pagination links
             ->through(function ($course) {
                 return [
                     'id' => $course->id,
                     'title' => $course->title,
                     'status' => ucfirst($course->status),
                     'category' => $course->category ? [
                         'id' => $course->category->id,
                         'name' => $course->category->name,
                     ] : null,
                     'created_at' => $course->created_at->format('Y-m-d H:i'),
                     'updated_at' => $course->updated_at->format('Y-m-d H:i'),
                 ];
             });

         // Get categories for filters (if needed)
         $categories = Category::select(['id', 'name'])
             ->orderBy('name')
             ->get();
---
select "id", "name" from "categories" where "categories"."id" in (1)
select "id", "name" from "categories" order by "name" asc

             ['name' => 'Courses', 'url' => null],
         ];

         return Inertia::render('Dashboard/Course/Index', [
             'title' => 'Courses Management',
             'courses' => $courses,
             'categories' => $categories,
             'filters' => [
                 'search' => $search,
                 'field' => $field,
                 'order' => $order,
             ],
             'perPage' => $perPage,
             'breadcrumbs' => $breadcrumbs,
             'stats' => [
                 'total' => Course::count(),
                 'active' => Course::where('status', 'active')->count(),
                 'inactive' => Course::where('status', 'inactive')->count(),
             ],
         ]);
---
select count(*) as aggregate from "courses" where "status" = 'active'

    public function create()
    {
        $categories = Category::select(['id', 'name'])->orderBy('name')->get();
---
select "id", "name" from "categories" order by "name" asc

    public function edit(Course $course)
    {
        $this->authorize('update', $course);

        $categories = Category::select(['id', 'name'])->orderBy('name')->get();
---
select "id", "name" from "categories" order by "name" asc