app/Http/Controllers/CategoryController.php

select count(*) as aggregate from "categories"
---
    public function index(Request $request)
    {
        $categories = Category::withCount('courses')
            ->when($request->search, fn($q) => $q->where('name', 'like', "%{$request->search}%"))
            ->paginate(10);