app/Http/Controllers/CourseController.php

select * from "categories"
---
    public function create()
    {
        $categories = Category::all();