app/Http/Controllers/CourseController.php

select "id", "name" from "categories" where "categories"."id" in (1)
select * from "courses" where "courses"."id" = '18' limit 1
select * from "sections" where "sections"."course_id" in (18)
---
    public function details($id)
    {
        $course = Course::with(['sections.lectures', 'instructor:id,name', 'category:id,name'])
            ->findOrFail($id);

select * from "courses" where "courses"."id" = '2' limit 1
select * from "sections" where "sections"."course_id" in (2)
---
    public function show($id, $courseSlug)
    {
        try {
            $course = Course::with([
                'sections.lectures',
                'instructor:id,name',
                'category:id,name'
            ])->findOrFail($id);

            $user = auth()->user();
            $sections = $course->sections;

            $statistics = [
                'lecturesCount' => $sections->sum(fn($section) => $section->lectures->count()),
                'totalDuration' => $sections->flatMap(fn($section) => $section->lectures)->sum('duration'),
                'enrollmentsCount' => Enrollment::where('course_id', $id)->count(),
                'completionRate' => $this->courseHelper->calculateCompletionRate($course),
            ];

select * from "enrollments" where "enrollments"."course_id" = 2 and "enrollments"."course_id" is not null and "user_id" = 1 limit 1
---
    public function enroll($courseId)
    {
        $user = auth()->user();
        $course = Course::findOrFail($courseId);

        $enrollment = Enrollment::firstOrCreate(
            [
                'user_id' => $user->id,
                'course_id' => $courseId
            ],
            [
                'enrollment_status' => 'active',
                'enrollment_date' => Carbon::now()
            ]
        );