app/Http/Controllers/EnrollmentController.php

    public function myCourses()
    {
        $user = Auth::user();
        /** @var \App\Models\User $user */

        $enrolledCourses = $user->enrollments()
            ->with([
                'course' => function ($query) {
                    $query->with(['category', 'instructor', 'lectures'])
                          ->withCount('lectures');
                },
                'course.lectures' => function ($query) use ($user) {
                    $query->whereHas('userProgress', function ($q) use ($user) {
                        $q->where('user_id', $user->id)->where('is_completed', true);
                    });
                }
            ])
            ->get()
            ->map(function ($enrollment) {
                $course = $enrollment->course;
                $completedLectures = $course->lectures->count();
                $totalLectures = $course->lectures_count;

                return [
                    'id' => $course->id,
                    'title' => $course->title,
                    'slug' => $course->slug,
                    'image' => $course->image,
                    'category' => $course->category->name ?? 'Uncategorized',
                    'instructor' => $course->instructor->name,
                    'progress' => $totalLectures > 0 ? round(($completedLectures / $totalLectures) * 100) : 0,
                    'completed_lectures' => $completedLectures,
                    'user_enrolled' => true, // User is enrolled since this is from enrollments
                    'total_lectures' => $totalLectures,
                    'enrolled_at' => $enrollment->created_at->format('M d, Y'),
                ];
            });
---
select "courses".*, (select count(*) from "lectures" where "courses"."id" = "lectures"."course_id") as "lectures_count" from "courses" where "courses"."id" in (2, 5, 17, 19, 23, 26)
select * from "enrollments" where "enrollments"."user_id" = 1 and "enrollments"."user_id" is not null
select * from "users" where "users"."id" in (5, 8, 20, 22, 26, 29)