app/Http/Controllers/UserController.php

    public function index(UserIndexRequest $request)
    {
        $users = User::query();
        if ($request->has('search')) {
            $users->where('name', 'LIKE', "%" . $request->search . "%")
                  ->orWhere('email', 'LIKE', "%" . $request->search . "%");
        }
        if ($request->has(['field', 'order'])) {
            $users->orderBy($request->field, $request->order);
        }
        $perPage = $request->has('perPage') ? $request->perPage : 10;
        $role = Auth::user()?->roles->first()?->name;
        $roles = Role::get();
        if ($role != 'superadmin') {
            $users->whereHas('roles', function ($query) {
                return $query->where('name', '<>', 'superadmin');
            });
            $roles = Role::where('name', '<>', 'superadmin')->get();
        }
        return Inertia::render('User/Index', [
            'title'         => __('app.label.user'),
            'filters'       => $request->all(['search', 'field', 'order']),
            'perPage'       => (int) $perPage,
            'users'         => $users->with('roles')->paginate($perPage),
---
select * from "roles"
select * from "roles" where "name" <> 'superadmin'
select * from "users" limit 10 offset 0
select count(*) as aggregate from "users"

    public function show(User $user)
    {
        try {
            $user->load('roles');
            $roles = Role::all();
---
select * from "roles"

    public function update(UserUpdateRequest $request, $id)
    {
        DB::beginTransaction();
        try {
            $user = User::findOrFail($id);
---
select * from "users" where "users"."id" = '1' limit 1

    public function loginAsUser(Request $request)
    {

        // Only allow admin login in local environment for security
        if (!app()->environment('local')) {
            abort(403, 'This feature is only available in local environment.');
        }
        // serch about user by email
        $userId = User::where('email', 'superadmin@superadmin.com')->first()->id;
        $user = User::find($userId);
---
select * from "users" where "email" = 'superadmin@superadmin.com' limit 1
select * from "users" where "users"."id" = 1 limit 1