app/Models/Setting.php

    public static function get(string $key, $default = null)
    {
        return Cache::remember("setting_{$key}", 3600, function () use ($key, $default) {
            $setting = static::where('key', $key)->first();
---
select * from "settings" where "key" = 'app_name' limit 1